#!/usr/bin/env python
# -*- coding:utf-8 -*-
# 创建和使用字典
# 创建格式：d = {key1 : value1, key2 : value2}
# dict特点：查找和插入速度极快，不会随着key的增加而变慢；需要占用大量的内存，内存浪费多

# 1.dict函数
print('********dict函数********')
student = [('name', '小明'), ('number', '1001')]
detail = dict(student)
print(detail)
print(detail['name'])

# 2.字典基本操作
# 修改字典
print('********修改字典********')
a = {'小明': '1001', '小强': '1002', '小华': '1003'}
# 更新
a['小强'] = '1112'
# 输出字典中key为小强中的value值
print('%(小强)s' % a)
# 新增
a['小峰'] = '1004'
print(a)
print('%(小峰)s' % a)

# 删除字典元素
print('********删除字典元素********')
b = {'小明': '1001', '小强': '1002', '小华': '1003', '小峰': '1004'}
# 删除
del b['小强']
print(b)

# len函数
print('********len函数********')
c = {'小明': '1001', '小强': '1002', '小华': '1003', '小峰': '1004'}
print('%d' % len(c))

# type函数
print('********type函数********')
d = {'小明': '1001', '小强': '1002', '小华': '1003', '小峰': '1004'}
print(type(d))